In [40]:
# 1. Kiểm tra openpyxl đã cài chưa
import importlib
try:
    import openpyxl
    print("openpyxl đã được cài đặt, phiên bản:", openpyxl.__version__)
except ImportError:
    print("Chưa cài openpyxl")

Chưa cài openpyxl

In [41]:
!pip install openpyxl

Defaulting to user installation because normal site-packages is not writeable
Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   ---------------------------------------- 0/2 [et-xmlfile]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5

In [ ]:
import pandas as pd

# Đọc file Excel
diem_df = pd.read_excel('bang_diem.xlsx')

# Hiển thị 5 dòng đầu tiên để kiểm tra
print(diem_df.head())

Ví dụ 4.8.1.1** sử dụng một DataFrame đơn giản gồm ba cột: Tuổi, Chiều cao, Cân nặng.

In [44]:
import pandas as pd

data = {
    'Tuổi': [16, 17, 16, 18, 17],
    'Chiều cao': [165, 170, 160, 172, 168],
    'Cân nặng': [55, 60, 52, 65, 58]
}

df = pd.DataFrame(data)
df

   Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

In [45]:
# Thống kê mô tả
df.describe()

           Tuổi   Chiều cao   Cân nặng
count   5.00000    5.000000   5.000000
mean   16.80000  167.000000  58.000000
std     0.83666    4.690416   4.949747
min    16.00000  160.000000  52.000000
25%    16.00000  165.000000  55.000000
50%    17.00000  168.000000  58.000000
75%    17.00000  170.000000  60.000000
max    18.00000  172.000000  65.000000

In [46]:
df.info

<bound method DataFrame.info of    Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58>

In [47]:
# Xét DataFrame ở ví dụ 5.8.8.1
df

   Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

In [48]:
q1 = df['Chiều cao'].quantile(0.25)
q3 = df['Chiều cao'].quantile(0.75)
iqr = q3 - q1
iqr

np.float64(5.0)

Ví dụ 4.8.2.1

In [49]:
# Tạo DataFrame đơn giản để minh họa groupby (Ví dụ 4.8.2.1)
df_data = {
    'key':['A','B','C','A','B','C'],
    'data':range(6)
}
df = pd.DataFrame(df_data, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [50]:
# 1. Tạo đối tượng GroupBy (Chưa tính toán)
grouped = df.groupby('key')
print("Đối tượng GroupBy (Lazy Evaluation):", type(grouped))

Đối tượng GroupBy (Lazy Evaluation): <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [51]:
# 2. Áp dụng phép tổng hợp (Tính toán thực tế)
print("\nKết quả sau khi áp dụng sum() (Bước Apply và Combine):")
print(grouped.sum()) #

Kết quả sau khi áp dụng sum() (Bước Apply và Combine):
     data
key
A       3
B       5
C       7

In [52]:
#Xem từng nhóm dữ liệu
grouped.get_group('A')          #các hàng có key='A" được gom thành một nhóm

  key  data
0   A     0
3   A     3

In [53]:
grouped.get_group('B')

  key  data
1   B     1
4   B     4

In [54]:
grouped.get_group('C')

  key  data
2   C     2
5   C     5

Ví dụ 4.8.2.2

In [55]:
import pandas as pd

data = {'Tên hs':['Bình', 'Hoa','Minh','Lan','Vân'],
        'Môn':['Toán','Lý','Toán','Hóa','Lý'],
        'Điểm':[8,9,7,6,8]
}
df=pd.DataFrame(data)
df

  Tên hs   Môn  Điểm
0   Bình  Toán     8
1    Hoa    Lý     9
2   Minh  Toán     7
3    Lan   Hóa     6
4    Vân    Lý     8

In [56]:
# Phân nhóm dữ liệu theo cột 'Môn'
grouped_mon = df.groupby('Môn')

In [57]:
# Truy cập cột 'Điểm' của từng nhóm
for ten_mon, df_nhom in grouped_mon: #ten_mon: Là nhãn nhóm (dữ liệu chuỗi: 'Toán', 'Lý', 'Hóa').
                                     #df_nhom: Là dữ liệu của nhóm (đối tượng DataFrame có thể tính toán).
    print(f"Nhóm: {ten_mon} :")
    print(df_nhom[['Điểm']])

Nhóm: Hóa :
   Điểm
3     6
Nhóm: Lý :
   Điểm
1     9
4     8
Nhóm: Toán :
   Điểm
0     8
2     7

In [58]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        'key':['A','B','C','A','B','C'],
        'giatri_1':np.random.randint(10,100,6),
        'giatri_2':np.random.randint(0,10,6)
    },
    columns=['key','giatri_1','giatri_2']
)
print("df: \n",df)

df:
   key  giatri_1  giatri_2
0   A        48         8
1   B        18         9
2   C        38         4
3   A        27         5
4   B        63         1
5   C        61         2

In [59]:
for key, giatri in df.groupby('key'):
    print("\nkey: ",key)
    print("value: \n",giatri)

key:  A
value:
   key  giatri_1  giatri_2
0   A        48         8
3   A        27         5

key:  B
value:
   key  giatri_1  giatri_2
1   B        18         9
4   B        63         1

key:  C
value:
   key  giatri_1  giatri_2
2   C        38         4
5   C        61         2

Ví dụ 4.8.2.4.

In [60]:
print(df.groupby('key').get_group('A'))

  key  giatri_1  giatri_2
0   A        48         8
3   A        27         5

In [7]:
!pip show seaborn

Name: seaborn
Version: 0.13.2
Summary: Statistical data visualization
Home-page:
Author:
Author-email: Michael Waskom <mwaskom@gmail.com>
License:
Location: C:\Users\thaon\AppData\Roaming\Python\Python313\site-packages
Requires: matplotlib, numpy, pandas
Required-by:

In [8]:
!python.exe -m pip install --upgrade pip

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pip in c:\users\thaon\appdata\roaming\python\python313\site-packages (25.3)

In [9]:
%pip install seaborn

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: seaborn in c:\users\thaon\appdata\roaming\python\python313\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from seaborn) (2.3.4)
Requirement already satisfied: pandas>=1.2 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from seaborn) (3.10.7)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.60.1)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.9)
Requirement already satisfied: packaging>=20.0 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Requirement already satisfied: pillow>=8 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (12.0.0)
Requirement already satisfied: pyparsing>=3 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.5)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\thaon\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

Load cơ sở dữ liệu Titanic, và hiển thị 05 mẫu đầu tiên

In [10]:
import pandas as pd
import seaborn as sns

# Nạp dữ liệu Titanic
titanic_data = sns.load_dataset("titanic")

# Hiển thị một số mẫu dữ liệu
titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic_data.groupby("sex")["age"].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [12]:
gb_age = titanic_data.groupby(["sex", "class"])["age"].mean()
gb_age_unstack = gb_age.unstack()
gb_age_unstack

C:\Users\thaon\AppData\Local\Temp\ipykernel_16144\1574282673.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  gb_age = titanic_data.groupby(["sex", "class"])["age"].mean()

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

vd cơ bản

In [13]:

pivot_age = pd.pivot_table(
    titanic_data,
    values="age",
    index="sex",
    columns="class",
    aggfunc="mean"
)
pivot_age

C:\Users\thaon\AppData\Local\Temp\ipykernel_16144\1541687047.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  pivot_age = pd.pivot_table(

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [14]:
titanic_data.isna().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

vd 4.9.1.

In [15]:
# Ví dụ 4.9.1.3 – Làm sạch dữ liệu
print('Số hàng ban đầu của CSDL:', len(titanic_data))

# Xóa cột 'deck'
titanic_data.drop(labels='deck', axis=1, inplace=True)

# Xóa toàn bộ các hàng có chứa giá trị NA
titanic_data.dropna(how='any', axis=0, inplace=True)

print('Số hàng còn lại trong CSDL:', len(titanic_data))

Số hàng ban đầu của CSDL: 891
Số hàng còn lại trong CSDL: 712

vd 4.9.2.1a

In [16]:
#import numpy để sử dụng các hàm thống kê
import numpy as np

survival_stats = pd.pivot_table(        #survival_stats: Thống kê về tỷ lệ sống sót
    data=titanic_data,
    index=['sex', 'class'],
    values='survived',
    aggfunc=['mean', 'sum', 'count'], # Sử dụng 3 hàm cùng lúc
    observed=True       # Chỉ hiển thị các nhóm thực sự tồn tại trong dữ liệu
)

print(survival_stats)

                   mean      sum    count
               survived survived survived
sex    class
female First   0.963855       80       83
       Second  0.918919       68       74
       Third   0.460784       47      102
male   First   0.396040       40      101
       Second  0.151515       15       99
       Third   0.150198       38      253

In [17]:
survival_stats = titanic_data.pivot_table(
    values='survived',
    index=['sex', 'class'],
    aggfunc=['mean', 'sum', 'count'],
    observed=True
)

# Đổi tên cột cho đúng nghĩa
survival_stats.columns = ['Tỷ_lệ_sống', 'Số_người_sống', 'Tổng_số_người']
print(survival_stats)

               Tỷ_lệ_sống  Số_người_sống  Tổng_số_người
sex    class
female First     0.963855             80             83
       Second    0.918919             68             74
       Third     0.460784             47            102
male   First     0.396040             40            101
       Second    0.151515             15             99
       Third     0.150198             38            253

vd 4.9.2.1b

In [18]:
# Phân tích tổng tiền vé và tỷ lệ sống sót theo Giới tính và Cảng lên tàu
mixed_agg = pd.pivot_table(
    data=titanic_data,
    index=['sex'],
    columns='embark_town',
    values=['fare', 'survived'],
    aggfunc={'fare': 'sum', 'survived': 'mean'} # Ánh xạ hàm cho từng cột
)

print(mixed_agg)

                  fare                         survived
embark_town  Cherbourg Queenstown Southampton Cherbourg Queenstown Southampton
sex
female       4876.1876   208.3667   7174.5459  0.901639   0.583333    0.715054
male         4002.3921   303.0750   8047.3157  0.347826   0.062500    0.184783

vd 4.9.2.1c

In [19]:
import numpy as np
# 1. Định nghĩa Hàm Tùy Chỉnh để tính Range
# Hàm lambda này nhận một Series (x) và trả về Max(x) - Min(x)
fare_range = lambda x: x.max() - x.min()

# 2. Áp dụng Hàm Tùy Chỉnh vào aggfunc
range_by_group = pd.pivot_table(
    data=titanic_data,
    index=['class', 'sex'],
    values='fare',
    # Truyền hàm tự định nghĩa (fare_range) vào aggfunc
    # Có thể kết hợp với các hàm khác như np.mean (Trung bình)
    aggfunc=[fare_range, np.mean, np.median],
    observed=True
)

print(range_by_group)

C:\Users\thaon\AppData\Local\Temp\ipykernel_16144\3397106404.py:7: FutureWarning: The provided callable <function mean at 0x0000018A2C530860> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  range_by_group = pd.pivot_table(
C:\Users\thaon\AppData\Local\Temp\ipykernel_16144\3397106404.py:7: FutureWarning: The provided callable <function median at 0x0000018A2C626520> is currently using DataFrameGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  range_by_group = pd.pivot_table(

               <lambda>        mean    median
                   fare        fare      fare
class  sex
First  female  486.4000  108.619680  83.15830
       male    512.3292   71.142781  52.00000
Second female   54.5000   21.951070  22.00000
       male     63.0000   21.113131  13.00000
Third  female   40.1500   15.875369  12.94585
       male     56.4958   12.162695   7.92500

In [20]:
# Tỷ lệ sống sót theo sex × class (theo giới tính và khoang hành khách)
titanic_data.pivot_table('survived',
                         index='sex',columns='class',
                         observed=True)

class      First    Second     Third
sex
female  0.963855  0.918919  0.460784
male    0.396040  0.151515  0.150198

4.9.2.2a

In [21]:
sample_count = pd.pivot_table(
    data=titanic_data,
    index='sex',
    columns='class',
    values='survived', # Chỉ cần một cột bất kỳ để đếm
    aggfunc='count',
    observed=True
)
print(sample_count)

class   First  Second  Third
sex
female     83      74    102
male      101      99    253

vd 4.9.2.

In [22]:
combined_stats = pd.pivot_table(#Tạo bảng tổng hợp dữ liệu về tỷ lệ sống sót và số lượng mẫu
    data=titanic_data,
    index=['sex', 'class'],         # Nhóm theo giới tính + hạng vé
    values='survived',              # Chỉ tính trên cột survived (0 hoặc 1)
    aggfunc=['mean', 'count'],      # Dùng đồng thời 2 hàm: mean và count
    observed=True
)
print(combined_stats)

                   mean    count
               survived survived
sex    class
female First   0.963855       83
       Second  0.918919       74
       Third   0.460784      102
male   First   0.396040      101
       Second  0.151515       99
       Third   0.150198      253

vd 4.9.2.

In [23]:
titanic_data.pivot_table('survived',
                         index='sex',columns='class',
                         margins=True, observed=True)

class      First    Second     Third       All
sex
female  0.963855  0.918919  0.460784  0.752896
male    0.396040  0.151515  0.150198  0.205298
All     0.652174  0.479769  0.239437  0.404494

4.9.3

In [24]:
# Ví dụ 4.9.2.6 [TLHT]
# Dùng phương thức cut() để chia CSDL Titanic_data theo cột 'age'
age = pd.cut(titanic_data['age'], [0, 18, 80])

print("Mô tả về độ tuổi: \n", age.describe())

Mô tả về độ tuổi:
 count          712
unique           2
top       (18, 80]
freq           573
Name: age, dtype: object

Ví dụ 4.9.3.2. Áp dụng `pd.qcut()` và `pd.cut()` kết hợp:

In [25]:
#Ví dụ 4.9.2.8 TLHT
age = pd.cut(titanic_data['age'], [0, 18, 80])
fare = pd.qcut(titanic_data['fare'], 2) # Chia đôi giá vé tại Trung vị

titanic_data.pivot_table('survived', ['sex', age], [fare, 'class'],observed=True)

fare            (-0.001, 15.646]                     (15.646, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.652174          0.909091
       (18, 80]              NaN  0.884615  0.435897          0.972222
male   (0, 18]               NaN  0.200000  0.260870          0.800000
       (18, 80]              0.0  0.094340  0.122222          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.350000
       (18, 80]  0.911765  0.400000
male   (0, 18]   0.800000  0.178571
       (18, 80]  0.032258  0.227273

vd 4.9.2.5

In [26]:
# Giá vé trung bình theo sex × class
pd.pivot_table(
    titanic_data,
    values='fare',
    index='sex',
    columns='class',
    margins=True,
    observed=True
)

class        First     Second      Third        All
sex
female  108.619680  21.951070  15.875369  47.332433
male     71.142781  21.113131  12.162695  27.268836
All      88.048121  21.471556  13.229435  34.567251

4.9.4. Các mẫu (pattern) Pivot Table thường gặp trong EDA**

In [27]:
pivot_age= pd.pivot_table(titanic_data, values="age",index="sex",columns="class",observed=True)
pivot_age

class       First     Second      Third
sex
female  34.240964  28.722973  21.750000
male    41.281386  30.740707  26.507589

4.9.4.

In [28]:
age_bins = pd.cut(titanic_data["age"], [0, 18, 40, 80])
pivot_seg = pd.pivot_table(                  #tạo bảng tổng hợp theo nhóm tuổi,
    titanic_data.assign(age_group=age_bins), #.assign() = thêm cột tạm thời mà không làm thay đổi DataFrame gốc, age_group là tên cột mới thể hiện nhóm tuổi (18-, 18-40, 40+)
    values="survived",
    index="age_group",
    columns="sex",
    aggfunc="mean",
    observed=True        #Đăt tham số observed=True để chỉ hiển thị các nhóm tuổi thực sự tồn tại trong dữ liệu.
)
pivot_seg

sex          female      male
age_group
(0, 18]    0.676471  0.338028
(18, 40]   0.784722  0.182143
(40, 80]   0.765957  0.176471

In [29]:
type(pivot_seg)

pandas.core.frame.DataFrame

In [30]:
pivot_seg.index

CategoricalIndex([(0, 18], (18, 40], (40, 80]], categories=[(0, 18], (18, 40], (40, 80]], ordered=True, dtype='category', name='age_group')

4.9.

4.9.8.

In [32]:
#cd_basic: Cross-Tabulation (bảng phân tích chéo)
ct_basic = pd.crosstab(titanic_data["sex"], titanic_data["class"])
ct_basic

class   First  Second  Third
sex
female     83      74    102
male      101      99    253

In [33]:
# 1. Cơ bản nhất: đếm số lượng hành khách theo giới tính và hạng vé
pd.crosstab(titanic_data['sex'], titanic_data['class'])

class   First  Second  Third
sex
female     83      74    102
male      101      99    253

In [34]:
# 2. Có tổng cộng bao nhiêu hành khách theo giớ tính và hạng vé đã lên tàu
pd.crosstab(titanic_data['sex'], titanic_data['class'], margins=True)

class   First  Second  Third  All
sex
female     83      74    102  259
male      101      99    253  453
All       184     173    355  712

In [35]:
# 3. Tính % theo hàng (hàng = 100%) – hay dùng nhất!
#Thống kê tỷ lệ phần trăm hành khách trong mỗi giới tính theo từng hạng vé.
pd.crosstab(titanic_data['sex'], titanic_data['class'], normalize='index')

class      First    Second     Third
sex
female  0.320463  0.285714  0.393822
male    0.222958  0.218543  0.558499

In [36]:
# 4. Tính % theo cột
#Thống kê tỷ lệ phần trăm hành khách trong mỗi hạng vé theo giới tính
pd.crosstab(titanic_data['sex'], titanic_data['class'], normalize='columns')

class      First    Second     Third
sex
female  0.451087  0.427746  0.287324
male    0.548913  0.572254  0.712676

In [37]:
# 5. Tính % trên tổng toàn bảng
#Thống kê tỷ lệ phần trăm hành khách trong toàn bộ bảng phân tích chéo
pd.crosstab(titanic_data['sex'], titanic_data['class'], normalize='all')

class      First    Second     Third
sex
female  0.116573  0.103933  0.143258
male    0.141854  0.139045  0.355337

In [38]:
# 6. Không chỉ đếm mà tính trung bình (cực mạnh!)
#Thống kê giá vé trung bình theo giới tính vá hạng vé
pd.crosstab(titanic_data['sex'], titanic_data['class'], #index theo hàng là  giới tính 'sex', theo cột là hạng vé 'class;
            values=titanic_data['fare'],
            aggfunc='mean')                 #hàm aggfunc='mean' để tính giá vé trung bình

class        First     Second      Third
sex
female  108.619680  21.951070  15.875369
male     71.142781  21.113131  12.162695

In [39]:
# 7. Combo (báo cáo) hoàn chỉnh
#Thống kê tổng số hành khách và tỷ lệ % theo giới tính và hạng vé, đồng thời tính % theo hàng để so sánh.
pd.crosstab(titanic_data['sex'], titanic_data['class'],
            margins=True,
            margins_name='Tổng cộng',
            normalize='index').round(3) * 100   # x100 để tính %

class      First  Second  Third
sex
female      32.0    28.6   39.4
male        22.3    21.9   55.8
Tổng cộng   25.8    24.3   49.9